multiphase/interPhaseChangeFoam/plate/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( -1.5  -0.5 -0.05 ) //  0
    ( -1.5 -0.05 -0.05 ) //  1
    ( -1.5  0.05 -0.05 ) //  2
    ( -1.5   0.5 -0.05 ) //  3
    (    0  -0.5 -0.05 ) //  4
    (    0 -0.05 -0.05 ) //  5
    (    0  0.05 -0.05 ) //  6
    (    0   0.5 -0.05 ) //  7
    ( 0.01  -0.5 -0.05 ) //  8
    ( 0.01 -0.05 -0.05 ) //  9
    ( 0.01  0.05 -0.05 ) // 10
    ( 0.01   0.5 -0.05 ) // 11
    (    3  -0.5 -0.05 ) // 12
    (    3 -0.05 -0.05 ) // 13
    (    3  0.05 -0.05 ) // 14
    (    3   0.5 -0.05 ) // 15
    ( -1.5  -0.5  0.05 ) // 16
    ( -1.5 -0.05  0.05 ) // 17
    ( -1.5  0.05  0.05 ) // 18
    ( -1.5   0.5  0.05 ) // 19
    (    0  -0.5  0.05 ) // 20
    (    0 -0.05  0.05 ) // 21
    (    0  0.05  0.05 ) // 22
    (    0   0.5  0.05 ) // 23
    ( 0.01  -0.5  0.05 ) // 24
    ( 0.01 -0.05  0.05 ) // 25
    ( 0.01  0.05  0.05 ) // 26
    ( 0.01   0.5  0.05 ) // 27
    (    3  -0.5  0.05 ) // 28
    (    3 -0.05  0.05 ) // 29
    (    3  0.05  0.05 ) // 30
    (    3   0.5  0.05 ) // 31
);

blocks
(
    hex (  0  4  5  1 16 20 21 17 ) ( 30 30 1 ) simpleGrading ( 0.03 0.125 1 )
    hex (  1  5  6  2 17 21 22 18 ) ( 30 20 1 ) simpleGrading ( 0.03     1 1 )
    hex (  2  6  7  3 18 22 23 19 ) ( 30 30 1 ) simpleGrading ( 0.03     8 1 )
    hex (  4  8  9  5 20 24 25 21 ) (  2 30 1 ) simpleGrading (    1 0.125 1 )
    hex (  6 10 11  7 22 26 27 23 ) (  2 30 1 ) simpleGrading (    1     8 1 )
    hex (  8 12 13  9 24 28 29 25 ) ( 80 30 1 ) simpleGrading (   25 0.125 1 )
    hex (  9 13 14 10 25 29 30 26 ) ( 80 20 1 ) simpleGrading (   25     1 1 )
    hex ( 10 14 15 11 26 30 31 27 ) ( 80 30 1 ) simpleGrading (   25     8 1 )
);

edges
(
);

patches
(
    wall plate
    (
        ( 9 10 26 25 )
        ( 6 10 26 22 )
        ( 5 21 25  9 )
        ( 5  6 22 21 )
    )
    patch inlet
    (
        ( 0 16 17 1 )
        ( 1 17 18 2 )
        ( 2 18 19 3 )
    )
    patch outlet
    (
        ( 12 13 29 28 )
        ( 13 14 30 29 )
        ( 14 15 31 30 )
    )
    wall upperWall
    (
        (  3 19 23  7 )
        (  7 23 27 11 )
        ( 11 27 31 15 )
    )
    wall lowerWall
    (
        ( 0  4 20 16 )
        ( 4  8 24 20 )
        ( 8 12 28 24 )
    )
    empty frontAndBack
    (
        ( 16 20 21 17 )
        ( 17 21 22 18 )
        ( 18 22 23 19 )
        ( 20 24 25 21 )
        ( 22 26 27 23 )
        ( 24 28 29 25 )
        ( 25 29 30 26 )
        ( 26 30 31 27 )
        (  0  1  5  4 )
        (  1  2  6  5 )
        (  2  3  7  6 )
        (  4  5  9  8 )
        (  6  7 11 10 )
        (  8  9 13 12 )
        (  9 10 14 13 )
        ( 10 11 15 14 )
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
