multiphase/interPhaseChangeFoam/plate/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phaseChangeTwoPhaseMixture SchnerrSauer;

pSat            pSat       [1 -1 -2 0 0]    2340;

sigma           sigma [1 0 -2 0 0 0 0] 0.0;

phase1
{
    transportModel Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 1e-6;
    rho             rho [1 -3 0 0 0 0 0] 1000;
}

phase2
{
    transportModel Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 0.0004273;
    rho             rho [1 -3 0 0 0 0 0] 0.023;
}

SchnerrSauerCoeffs
{
    n               n      [0 -3 0 0 0 0 0]     1e+8;
    dNuc            dNuc   [0 1 0 0 0 0 0]      1.2e-04;
    Cc              Cc     [0 0 0 0 0 0 0]      1.0;
    Cv              Cv     [0 0 0 0 0 0 0]      1.0;
}

// ************************************************************************* //
