multiphase/interPhaseChangeFoam/plate/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application                interPhaseChangeFoam;

startFrom                  latestTime;

startTime                  0;

stopAt                     endTime;

endTime                    5;

deltaT                     2e-4;

writeControl               timeStep;

writeInterval              50;

purgeWrite                 0;

writeFormat                ascii;

writePrecision             12;

writeCompression           uncompressed;

timeFormat                 general;

runTimeModifiable          yes;

// ************************************************************************* //
