multiphase/interPhaseChangeFoam/plate/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    alpha1
    {
        maxUnboundedness 1;
        CoCoeff          0.2;
        maxIter          100;
        nLimiterIter     10;

        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-6;
        relTol           0;
    };

    U 
    { 
        type            coupled;
        solver          PBiCCCG; 
        preconditioner  DILU; 
        tolerance       (1e-06 1e-06 1e-06); 
        relTol          (0 0 0); 
    }
 
    UFinal
    { 
        type            coupled;
        solver          PBiCCCG; 
        preconditioner  DILU; 
        tolerance       (1e-06 1e-06 1e-06); 
        relTol          (0 0 0); 
    }

    p_rgh
    {
        solver            PCG;
        preconditioner
        {
            preconditioner  GAMG;

            tolerance        1e-6;
            relTol           0;

            nVcycles         5;

            smoother         DICGaussSeidel;
            nPreSweeps       0;
            nPostSweeps      1;
            nFinestSweeps    2;

            cacheAgglomeration true;
            nCellsInCoarsestLevel 8;
            agglomerator     faceAreaPair;
            mergeLevels      1;
        };
        tolerance        1e-6;
        relTol           0.;
        maxIter          150;
    };

    p_rghFinal
    {
        solver            PCG;
        preconditioner
        {
            preconditioner  GAMG;

            tolerance        1e-6;
            relTol           0;

            nVcycles         5;

            smoother         DICGaussSeidel;
            nPreSweeps       0;
            nPostSweeps      1;
            nFinestSweeps    2;

            cacheAgglomeration true;
            nCellsInCoarsestLevel 8;
            agglomerator     faceAreaPair;
            mergeLevels      1;
        };
        tolerance        1e-6;
        relTol           0;
        maxIter          100;
    };

    pcorr
    {
        solver            PCG;
        preconditioner
        {
            preconditioner  GAMG;

            tolerance        1e-6;
            relTol           0;

            nVcycles         5;

            smoother         DICGaussSeidel;
            nPreSweeps       0;
            nPostSweeps      1;
            nFinestSweeps    2;

            cacheAgglomeration false;
            nCellsInCoarsestLevel 10;
            agglomerator     faceAreaPair;
            mergeLevels      1;
        };
        tolerance        1e-6;
        relTol           0;
        maxIter          100;
    };
}

PIMPLE
{
    nMomentumPredictors        2;
    nOuterCorrectors           4;
    nCorrectors                2;
    nNonOrthogonalCorrectors   0;

    cAlpha                     0;
    nAlphaCorr                 2;
    nAlphaSubCycles            1;
}

// ************************************************************************* //
